#
gap> l := [ 33535, 257833, 307870, 328116, 460798, 479456, 618943,
> 673099, 711526, 739160, 902414, 1099623, 1129189, 1144896, 1189481,
> 1260533, 1632485, 1705746, 1814579, 1867875, 1909292, 2219660,
> 2317943, 2462801, 2559754, 2570152, 2601938, 2668386, 2675753,
> 2715942, 2741892, 2783896, 2810670, 2923869, 3024001, 3187219,
> 3220897, 3232156, 3341822, 3491758, 3531026, 3550452, 3656502,
> 3898772, 3914343, 3982688, 3995085, 4237584, 4300777, 4497648,
> 4502893, 4528345, 4533592, 4782825, 4886560, 4955429, 4978650,
> 5008902, 5103860, 5510658, 5527707, 6141519, 6302470, 6427343,
> 6483273, 6654572, 6658732, 6913224, 6962504, 7131810, 7219037,
> 7247687, 7344026, 7428228, 7556533, 7561237, 7704355, 7750449,
> 7792053, 7908087, 8026745, 8149914, 8486764, 8497818, 8608616,
> 8768131, 8782269, 8920966, 9006881, 9137082, 9223718, 9778058,
> 9792929, 9962078, 10016192, 10309537, 10314298, 10334950, 10445707,
> 10465791 ];;
gap> gs := List(l, x -> SmallGroup(512, x));;
gap> Length(gs) = Length(l);
true

#
gap> List([2,3,4,5,6], x -> CodePcGroup(OneSmallGroup(128,Rank,x)));
[ 3551146855211248660685, 2254033733550151, 2233919864839, 17448304643, 
  134217729 ]

#
gap> for i in [1..100] do
>   n:=Random(1, NrSmallGroups(512));
>   G:=SmallGroup(512,n);
>   id:=IdStandardPresented512Group(G);
>   if id <> [512,n] then Error("IdStandardPresented512Group failed for ", n); fi;
> od;

#
